{ "quizone": [
  {
    "question_j": "What is a boolean?",
    "correct_j": "c",
    "box_type_j": "multiple",
    "code_box_j": "none",
    "hint_j": "Do or do not, there is no try. --Master Yoda",
    "answers_j": {
      "a": "True",
      "b": "False",
      "c": "A value of True or False, but never both.",
      "d": "Something you add to soup."
    }
  },
  {
    "question_j": "What makes a parameter different from an argument?",
    "correct_j": "b",
    "box_type_j": "multiple",
    "code_box_j": "none",
    "hint_j": "I got the dog a bed, but the cat took it over.",
    "answers_j": {
      "a": "A parameter keeps the chickens from escaping. Arguements make them angry.",
      "b": "The context. A parameter is a placeholder, the argument is the thing that occupies that place.",
      "c": "They are exactly the same.",
      "d": "about 5 kilos give or take."
    }

  },
  {
    "question_j": "An algorithm is which of these things:",
    "correct_j": "d",
    "box_type_j": "multiple",
    "code_box_j": "none",
    "hint_j": "A process or set of rules to be followed in obtaining some result.",
    "answers_j":{
      "a": "A chicken and dumplings recipe.",
      "b": "The instructions for hooking up my computer moniter.",
      "c": "a formula for determining the nth fibonacci number.",
      "d": "All of the above."
    }

  },
  {
    "question_j": "Modern computers use electrical signals in the hardware to store and transmit data.",
    "correct_j": "True",
    "box_type_j": "TorF",
    "code_box_j": "none",
    "hint_j": "I turned the light switch to on, and light appeared.",
    "answers_j": {
      "T": "True, although there is space to argue magnetism is the true hero of modern data storage.",
      "F": "False, this is the Matrix, binary data is stored in humans living in pods of fluid goo."
    }

  },
  {
    "question_j": "A files 'extension' is the type of file the computer reads it as.  A .txt file is also known as:",
    "correct_j": "d",
    "box_type_j": "multiple",
    "code_box_j": "none",
    "hint_j": "Hello, Extension 560 dairy department please.",
    "answers_j": {
      "a": "a text file",
      "b": "plain text file",
      "c": "a file formatted as a sequence of lines of electronic text.",
      "d": "all of the above.  wink wink, nudge nudge."
    }

  },
  {
    "question_j": "A method is a procedure used in a particular manner to interpret and use data",
    "correct_j": "True",
    "box_type_j": "TorF",
    "code_box_j": "none",
    "hint_j": "Her method of straining the noodles, had four steps.",
    "answers_j": {
      "T": "True, some methods are simple recipes, some are highly complex data manipulation.",
      "F": "False, Logically if she weighs the same as a duck, she's made of wood!"
    }
  },
  {
    "question_j": "How would you describe a recursive function?",
    "correct_j": "c",
    "box_type_j": "multiple",
    "code_box_j": "none",
    "hint_j": "I will not stop until every apple has been plucked from this tree.",
    "answers_j": {
      "a": "a function that calls another function",
      "b": "a function that breaks your app, computer and sometimes the wifi",
      "c": "a function that calls itself until a base case is met",
      "d": "a function that loops all day everyday"
    }

  },
    {
      "question_j": "Regular expressions help us do what?",
      "correct_j": "b",
      "box_type_j": "multiple",
      "code_box_j": "none",
      "hint_j": "I thought his name started with a B... Barnaby? Bob? Barkley?",
      "answers_j": {
        "a": "alleviate stress through verbalizing emotions with code",
        "b": "match combinations of characters in string values",
        "c": "add description to code directly in the code without interfering",
        "d": "join together multiple arrays into one"
    }
  },
  {
    "question_j": "The zero, in binary is a -low volatage signal, while the one is high-volatage (5 volts).",
    "correct_j": "True",
    "box_type_j": "TorF",
    "code_box_j": "none",
    "hint_j": "Electricity has no voltage if a circuit is off, and voltage if a circuit is on.",
    "answers_j": {
      "T": "True, just like an on/off signal,  this is why 0 is commonly a representation of False/null/None.",
      "F": "False, Zero is a hero."
    }
  },
{
  "question_j": "This is some JavaScript code. var means variable.  What is the variable catsName value?",
  "correct_j": "a",
  "box_type_j": "multiple",
  "code_box_j": "var catsName = 'Sage';\nconsole.log(catsName);",
  "hint_j": "She is a pretty kitty, decendant of the mountain beasts of yore.",
  "answers_j": {
    "a": "'Sage'",
    "b": "Here's the bit I look up some crazy binary code for the characters in Sage.",
    "c": "Or I could look up how many integers the memory would assign to that pointer.",
    "d": "Anyone got some catnip?"
  }
}
],
  "quiztwo": [
    {
      "question_j": "What is a string type in computers?",
      "correct_j": "b",
      "box_type_j": "multiple",
      "code_box_j": "none",
      "hint_j": "I wrote a letter, but it only has one.",
      "answers_j": {
        "a": "something that ties a sequence of items together",
        "b": "A sentence, a character, a word, usually denoted by the single or double quotes. Unicode and ASCII are examples of character encoding.",
        "c": "Where particles are linked through the quantum gravity of one dimensional objects.",
        "d": "The stuff in a can your parent never let you buy from the dollar store."
      }
    },
    {
      "question_j": "A string is stored in a computer as an array, (sequence of characters in byte code).",
      "correct_j": "True",
      "box_type_j": "TorF",
      "code_box_j": "none",
      "hint_j": "An array is just a term for data that is held in sequence/arrangement in memory.",
      "answers_j": {
        "T": "While the exact data structure may be different on a given machine, it is an array type structure.",
        "F": "If a string is stored as an array, how come my spell check always wants to correct it to -duck-?"
      }
    },
  {
    "question_j": "You can store characters, numbers, symbols in a string and a string can even be empty.",
    "correct_j": "True",
    "box_type_j": "TorF",
    "code_box_j": "none",
    "hint_j": "When they have you make complex passwords, eyeH8allth3s3Pa55w0rds, it is stored as a string.",
    "answers_j": {
      "T": "True, an empty string is stored basically as a string of length 0.",
      "F": "False, three inch strings for: Tying up very small parcels, attatching notes to pigeons' legs, uh, destroying household pests..."
     }
   },
 {
    "question_j": "Why are the quotation marks so important to coding languages? (code: Python)",
    "correct_j": "a",
    "box_type_j": "multiple",
    "code_box_j": "x = 'Peanut Butter'\ndef check(x):\n    x = x.lower()\n    if 'peanut' in x:\n       Warning = 'This contains peanuts'\n       print(Warning)",
    "hint_j": "If typo's were bugs, I must have killed a million by now.",
    "answers_j": {
      "a": "Quotes make recognizing strings and characters in code easier for the computer and the coder.",
      "b": "I'm so sorry to anyone who can't eat a reeses peanut butter cup.",
      "c": "If you're ever a ghost you have my full permission to posess me to eat a peanut butter cup.",
      "d": "Why are there always empty Reese's packages by my bed when I wake up?"
     }
   },
   {
     "question_j": "An integer can be stored in a string, and you CAN perform math on it.",
     "correct_j": "False",
     "box_type": "TorF",
     "code_box": "none",
     "hint_j": "string and integer are two very different things in computer processing.",
     "answers_j": {
       "T": "True, one plus two equals five yes?",
       "F": "False, math can be performed on many integer types, but a string is not one of those."
     }
   },
   {
     "question_j": "Character encoding can do many things, What will the returned string (x) be in this code?(Python)",
     "correct_j": "c",
     "box_type_j": "multiple",
     "code_box_j": "def encode_it(a_string):\n    #reverse the string\n    new = a_string[::-1]\n    return new\nx = encode_it('password')",
     "hint_j": " What the [::-1] does is make a new string starting from the last item, stepping through (right to left) to the first.",
     "answers_j": {
       "a": "Dubstep",
       "b": "Drow fra Bisina.",
       "c": "drowssap",
       "d": "#seeItatTheSeaShore"
     }
   },
   {
     "question_j": "Which of these strings will print without error?(Python)",
     "correct_j": "a",
     "box_type_j": "multiple",
     "code_box_j": "One_String = 'this is a single quote.'\nTwo_String = \"this is a double quote.\"\nThree_String = \"this is a mixed 'quotes'.\" \nFour_String = 'this is also a mixed \"quotes\".' \nFive_String = 'this string needs an \"\\ escape quote.' \nSix_String = \" so does \"\\this\"\\ one.\"",
     "hint_j": "These all printed in a python print statement. There are no trick questions. Only hints to point you at the right answers.",
     "answers_j": {
       "a": "All of them.",
       "b": "Six_String and Five_String",
       "c": "a",
       "d": "None of these are strings."
     }
   },
   {
     "question_j": "Why is it important for an html file to have this bit of code? (language varies.)",
     "correct_j": "b",
     "box_type_j": "multiple",
     "code_box_j": "\n html lang=\"en\" \n",
     "hint_j": "It is said when people become used to their screen reader, they can go 300+ words per minute.",
     "answers_j": {
       "a": "So hackers know how to taunt you in French.",
       "b": "Both c  and  d.  <--------",
       "c": "This assists browsers and search engines in finding appropriate results.",
       "d": "Screen readers use this as an indicator on which language to read the text on your page in."
     }
   }
  ],
  "quizthree": [
    {
      "question_j": "An example of how a off by one error can occur is:",
      "correct_j": "d",
      "box_type_j": "multiple",
      "code_box_j": "none",
      "hint_j": "We start with 0, and add to that. So zero is often thought of as a starting point.",
      "answers_j": {
        "a": "On the count of 3",
        "b": "So, after you say the word two... or after you say the word three?",
        "c": "Lets just not count.",
        "d": "The list/array has 10 items in it, so I try to loop through index 1 - 10."
      }
    },
  {
      "question_j": "A low level computer language simplified definition:",
      "correct_j": "a",
      "box_type_j": "multiple",
      "code_box_j": "none",
      "hint_j": "Many high-level languages use abstraction, are very human readable, but require being compiled/translated to a lower-level language.",
      "answers_j": {
        "a": "A language very close to machine. This kind of code is used by the machine for very specific and declared purposes set by the user written code.",
        "b": "I told Hal to open the pod bay doors, but it refused.",
        "c": "Python like other high-level languages rely on a compiler to translate the code into something the machine can understand.",
        "d": "Within the code written by the user are many hidden processes the computer must translate without the coder's knowledge."
      }
    },
  {
      "question_j": "An if statement checks whether a given variable of some type, is existent, True, of some specified value.",
      "correct_j": "True",
      "box_type_j": "TorF",
      "code_box_j": "none",
      "hint_j": "If I fits, I sits.",
      "answers_j": {
        "T": "True, and it can also verify if something is NOT true, NOT equal to, or NOT existent (null-None), and many more.",
        "F": "False, An if statement only qualifies wether an argument is plausible and deniable."
      }
    },
  {
      "question_j": "What do you think this code (JavaScript) does?",
      "correct_j": "c",
      "box_type_j": "multiple",
      "code_box_j": "if(chocolate){\n     eat(choclate) };",
      "hint_j": "there is chocolate in this room, and I shall EAT IT.",
      "answers_j": {
        "a": "Makes me happy.",
        "b": "Defends against the Dementor's sadness.",
        "c": "if chocolate exists, is true, and is not 0/null/none, then perform eat on chocolate.",
        "d": "42"

      }
    },
  {
      "question_j": "What decade was the world wide web technology being produced by Tim Berners-Lee?",
      "correct_j": "b",
      "box_type_j": "multiple",
      "code_box_j": "none",
      "hint_j": "Decade of:  The Goonies, E.T., Gremlins, Aliens, The Princess Bride....",
      "answers_j": {
        "a": "1880s",
        "b": "1980s",
        "c": "1990s",
        "d": "Where we're going, we don't need roads."

      }
    },
  {
        "question_j": "Turing Complete is a term coined after the father of Computer Science.",
        "correct_j": "True",
        "box_type_j": "TorF",
        "code_box_j": "none",
        "hint_j": "He invented a machine called 'Enigma' that helped stop World War 2, how cool is that?",
        "answers_j": {
          "T": "True, his concepts of Algorithms and Computation are a driving force in CS to this day.",
          "F": "..."

        }
      },
    {
          "question_j": "Why do we call the main circuit board of a computer the 'Motherboard'?",
          "correct_j": "d",
          "box_type_j": "multiple",
          "code_box_j": "none",
          "hint_j": "Like a mother, it is the main hub for distribution and 'where did I put that thing mom?'.",
          "answers_j": {
            "a": "They needed a different term than 'mainboard', mainboards were not extensible.",
            "b": "Because daughterboards are extensions plugged into it to add more circuits/processing.",
            "c": "It is the main ciruit board for processing signals.",
            "d": "All of the above."

          }
        },
    {
          "question_j": "Forms take user data and send it to a web server.  This is commonly called a POST request.  How does the data get delivered?",
          "correct_j": "b",
          "box_type_j": "multiple",
          "code_box_j": "none",
          "hint_j": "What would you request sun screen for?.",
          "answers_j": {
            "a": "The data gets transferred via third party JavaScript libraries",
            "b": "The data is sent through an HTTP request and included in the request body aka payload.",
            "c": "Mozilla runs the interweb.",
            "d": "The data is saved to the header of a response."

          }
        },
    {
          "question_j": "Status codes summarize the outcome of an http request.  Which of the following is not true about them?",
          "correct_j": "c",
          "box_type_j": "multiple",
          "code_box_j": "none",
          "hint_j": "status codes have 3 digits",
          "answers_j": {
            "a": "They signal if an http request was processed successfully",
            "b": "404 reveals the server did not locate a matching resource.",
            "c": "908 tells us to keep waiting.",
            "d": "5 prefixes a server error."

          }
        },
    {
          "question_j": "MIME types exist in the HTTP world.  Which of the following best describes MIME types?",
          "correct_j": "b",
          "box_type_j": "multiple",
          "code_box_j": "none",
          "hint_j": "",
          "answers_j": {
            "a": "They are event handlers within event handlers",
            "b": "They are set in the Content-Type response header and tells the client how to parse an HTML response body.",
            "c": "They are tags used to prevent screen readers from reading element contents out loud",
            "d": "It prints your html code via the nearest printer."

          }
        }
  ],
  "quizfour" : [
    {
      "question_j": "What is RAM?",
      "correct_j": "a",
      "box_type_j": "multiple",
      "code_box_j": "none",
      "hint_j": "This type of memory needs power to store data. It is temporary.",
      "answers_j": {
        "a": "Random Access Memory. With this, you can work on your word document, but if you turn off your computer without 'saving', the work is lost.",
        "b": "Dodge?",
        "c": "Readily Avaliable Microprocesses,  Kind of...  Don't pick this one.",
        "d": "Where permenant data is stored in the Motherboard. --not this one either."

     }
   },
  {
      "question_j": "What is a linked list?",
      "correct_j": "c",
      "box_type_j": "multiple",
      "code_box_j": "none",
      "hint_j": "It's almost literal, data is linked.",
      "answers_j": {
        "a": "The grocery list, but you can't get to the next item you need until the first one is in the cart.",
        "b": "Start -->  middle ---> End",
        "c": "Pieces of data that are joined by their reference(pointer) to the next or previous piece of data. (Sometimes both.)",
        "d": "Sounds like something for a tech interview."

    }
  },
  {
    "question_j": "A Queue is First in - First out, while a Stack is Last-in - First-out",
    "correct_j": "True",
    "box_type_j": "TorF",
    "code_box_j": "none",
    "hint_j": "Standing in line at the bank, is a Queue. Going through a pile of books, by grabbing the top one is a stack.",
    "answers_j": {
      "T": "True, Sometimes keeping data in these kinds of structures is for the specific order involved in either one.",
      "F": "False, I can't think of any way to joke about Queue's and Stacks."

    }
  },
  {
    "question_j": "What does the x equal at the last line of this code?(Python)",
    "correct_j": "d",
    "box_type_j": "multiple",
    "code_box_j": "class Dog(object):\n    def __init__(self):\n        self.name = 'Fred'\nx=Dog()",
    "hint_j": "A Python object is like a Tupperware.  It is labled, and holds all it's components inside.",
    "answers_j": {
      "a": "x is 5?",
      "b": "x is not defined.",
      "c": "x is a cat",
      "d": "x is a Dog object that has the name Fred."
     }
   },
   {
   "question_j": "This is a python dictionary example.  What do you think will print?",
   "correct_j": "c",
   "box_type_j": "multiple",
   "code_box_j": "myDog = {\n\t'dogsName': 'George',\n\t'state': 'Michigan',\n\t'county': 'Montcalm'\n}\nprint(myDog.get('state'))",
   "hint_j": "The key-value pair system means that if I look for the key: 'state' in myDog, I will get 'Michigan' as a return value. ",
   "answers_j": {
     "a": "Python loves dictionaries.",
     "b": "George loves a good shoe to chew on.",
     "c": "Michigan",
     "d": "Dog house."
   }
 },
 {
 "question_j": "This is a python tuple (code box below).  You can get the item in the tuple starting at 0. Which cat's name will print?",
 "correct_j": "d",
 "box_type_j": "multiple",
 "code_box_j": "\nMyCats = ('Sage', 'Matcha')\nprint(MyCats[0])",
 "hint_j": "The [0] -square brackets- are indicating we want the item at position/index 0 in MyCats",
 "answers_j": {
   "a": "undefined",
   "b": "NameError",
   "c": "Matcha",
   "d": "Sage"
 }
},
{

"question_j": "An array is a data structure that uses keys or indexes, to place in memory a given value. Choose the answers that are true about arrays.",
"correct_j": "d",
"box_type_j": "multiple",
"code_box_j": "none",
"hint_j": "Wikipedia is an awesome resource.",
"answers_j": {
  "a": "John von Neumann wrote the first array-sorting program (merge sort) in 1945",
  "b": "Instead of having pointers like a linked list, the array uses math to determine where an array item is in memory.",
  "c": "The memory address of the first element of an array is called first address, foundation address, or base address.",
  "d": "All of the above.  Thanks Wikipedia."
}
}
 ]
}
