{ "quizone": [
  {
    "question_j": "What is a boolean?",
    "correct_j": "c",
    "box_type_j": "multiple",
    "answers_j": {
      "a": "True",
      "b": "False",
      "c": "A value of True or False, but never both.",
      "d": "Something you add to soup."
    }
  },
  {
    "question_j": "What makes a parameter different from an arguement?",
    "correct_j": "b",
    "box_type_j": "multiple",
    "answers_j": {
      "a": "A parameter keeps the chickens from escaping. Arguements make them angry.",
      "b": "The context. A parameter is a placeholder, the arguement is the thing that occupies that place.",
      "c": "They are exactly the same.",
      "d": "about 5 kilos give or take."
    }

  },
  {
    "question_j": "Modern computers use electrical signals in the hardware to store and transmit data.",
    "correct_j": "True",
    "box_type_j": "TorF",
    "answers_j": {
      "T": "True, although there is space to argue magnetism is the true hero of modern data storage.",
      "F": "False, this is the Matrix, binary data is stored in humans living in pods of fluid goo."
    }

  },
  {
    "question_j": "A files 'extenstion' is the type of file the computer reads it as.  A .txt file is also known as:",
    "correct_j": "d",
    "box_type_j": "multiple",
    "answers_j": {
      "a": "a text file",
      "b": "plain text file",
      "c": "a file formatted as a sequence of lines of electronic text.",
      "d": "all of the above.  wink wink, nudge nudge."
    }

  },
  {
    "question_j": "A method is a procedure used in a particular manner to interpret and use data",
    "correct_j": "True",
    "box_type_j": "TorF",
    "answers_j": {
      "T": "True, some methods are simple recipes, some are highly complex data manipulation.",
      "F": "False, Logically if she weighs the same as a duck, she's made of wood!"
    }
  },
  {
    "question_j": "How would you describe a recursive function?",
    "correct_j": "c",
    "box_type_j": "multiple",
    "answers_j": {
      "a": "a function that calls another function",
      "b": "a function that breaks your app, computer and sometimes the wifi",
      "c": "a function that calls itself until a base case is met",
      "d": "a function that loops all day everyday"
    }
  },
    {
      "question_j": "Regular expressions help us do what?",
      "correct_j": "b",
      "box_type_j": "multiple",
      "answers_j": {
        "a": "alleviate stress through verbalizing emotions with code",
        "b": "match combinations of characters in string values",
        "c": "add description to code directly in the code without interfering",
        "d": "join together multiple arrays into one"
    }
  }
],
  "quiztwo": [
    {
      "question_j": "What is a string type in computers?",
      "correct_j": "b",
      "box_type_j": "multiple",
      "answers_j": {
        "a": "something that ties a sequence of items together",
        "b": "A sentence, a character, a word, usually denoted by the single or double quotes. Unicode and ASCII are examples of character encoding.",
        "c": "Where particles are linked through the quantum gravity of one dimensional objects.",
        "d": "The stuff in a can your parent never let you buy from the dollar store."
      }
    },
    {
      "question_j": "A string is stored in a computer as an array, (sequence of characters in byte code).",
      "correct_j": "True",
      "box_type_j": "TorF",
      "answers_j": {
        "T": "While the exact data structure may be different on a given machine, it is an array type structure.",
        "F": "If a string is stored as an array, how come my spell check always wants to correct it to -duck-?"
      }
    }
  ],
  "quizthree": [
    {
      "question_j": "An example of how a off by one error can occur is:",
      "correct_j": "d",
      "box_type_j": "multiple",
      "answers_j": {
        "a": "On the count of 3",
        "b": "So, after you say the word two... or after you say the word three?",
        "c": "Lets just not count.",
        "d": "The list/array has 10 items in it, so I try to loop through index 1 - 10."
      }
    }
  ]
}
